// proyecto_final.cpp : Este archivo contiene la función "main". La ejecución del programa comienza y termina ahí.
//
#include <iostream>
#include <fstream>
#include <string>
#include <cstdlib>
#include <stdio.h>
#include <stdlib.h>



extern "C" void Imagen(char* cad,char* cadRetorno,int tam);//Convierte en minúsculas la cadena cad.

using namespace std;
void leerArchivo();

int main()
{
    char img[]="       ÅÖàÅÖàÇÕàÇÕàÇÕàÇÕàÇÕàÇÕàÊÖâÊÖâË×ãË×ãË×ãÌØäÎØäÎØäÌÚåÌÚåÌÚåÍÛæÍÛæÍÛæÎÜçÎÜçÎÜçÎÜçÍÛæÌÚåÊØãÉ×âÈÖáÈÖáÈÕÞÈÕÞÉÖßÉÖßÉÖßÊ×àÊ×àÊ×àÊ×àÊ×àËØáËØáËØáÌÙâÌÙâÌÙâÌÙâÌÙâÌÙâÌÙâÌÙâÌÙâÌÙâÌÙâÌÙâÌÙâÍÚãÍÚãÍÚãÎÛäÎÛäÎÛäÔÞèÕßéÖàê×áëØâìÙãíÚäîÛåïÛåïÚäîÚäîÛåïÜæðÞèòàêôáëõâïõãðöåòøæóùèõûèõûèõûèõûëøþëøþìùÿìùÿìùÿëøþéöüèõûî÷üî÷üî÷üî÷üî÷üî÷üî÷üî÷üïøýî÷üíöûìõúìõúíöûî÷üïøýíøüíøüíøüíøüíøüíøüíøüíøüîùýîùýïúþïúþðûÿðûÿðûÿðûÿõýÿõýÿõýÿõýÿõýÿõýÿõýÿõýÿõÿÿôþÿôþÿôþÿóýþóýþòþþòþþòÿÿñÿÿñÿÿóþÿòýÿòýÿòýÿñüþñüþóýþóýþóýþôþÿôþÿôþÿõÿÿöÿþöÿþöÿþöÿþöÿþöÿþöÿþöÿþöÿþöÿþöÿþöÿþöÿþöÿþöÿþöÿþùÿÿùÿÿùÿÿùÿÿùÿÿùÿÿùÿÿùÿÿùÿÿùÿÿùÿÿùÿÿùÿÿùÿÿùÿÿùÿÿöÿþöÿþöÿþöÿþöÿþöÿþöÿþöÿþöÿþöÿþõþýõþýõþýôýüôýüôýüïþûïþûñýýñýýñýýòüýòüýòüýõýÿõýÿ÷üÿ÷üÿ÷üÿøûÿøûÿøûÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿõýÿõýÿõýÿõýÿõýÿõýÿõýÿõýÿ÷üÿ÷üÿ÷üÿ÷üÿ÷üÿ÷üÿ÷üÿ÷üÿõúþõúþõúþõúþõúþõúþõúþõúþóúÿóúÿóúÿòùÿòùÿòùÿñøþñøþð÷ýð÷ýð÷ýð÷ýð÷ýð÷ýð÷ýð÷ýðúüðúüðúüðúüñûýñûýñûýòüþòüþòüþòüþòüþòüþòüþòüþòüþòúýòúýòúýòúýòúýòúýòúýòúýóûþóûþóûþóûþóûþóûþóûþóûþ÷üÿ÷üÿöûÿôüÿôüÿóûþóûþóûþòúýñûýñûýñûýñûýñûýñûýñûýòúýòúýòúýòúýòúýòúýòúýòúýòúýòúýóûþóûþóûþôüÿôüÿôüÿôþÿôþÿôþÿôþÿõýÿõýÿõýÿõýÿõýÿ÷üÿøþþøþþùÿÿùÿÿùÿÿùÿÿûÿÿûÿÿûÿÿûÿÿýþÿýþÿýþÿýþÿþÿÿþÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿ";
    //string pruebaA;
   // cadena = &temp[0];
   // char prueba[] = "¶♣  ►♦  ♥   ┼ÍÓ┼ÍÓÃıÓÃıÓÃıÓÃıÓÃıÓÃıÓ╩ÍÔ╩ÍÔ╦ÎÒ╦ÎÒ╦ÎÒ╠Ïõ╬Ïõ╬Ïõ╠┌Õ╠┌Õ╠┌Õ═█µ═█µ═█µ╬▄þ╬▄þ╬▄þ╬▄þ═█µ╠┌Õ╩ÏÒ╔ÎÔ╚Íß╚Íß╚ıÌ╚ıÌ╔Í▀╔Í▀╔";
   // char prueba[] = "(¶♣  ►♦  ♥   ┼ÍÓ┼ÍÓÃıÓÃıÓÃıÓÃıÓÃı";

    //fopen
    char cadRetorno[] = "";
    int tam = strlen(img);
    cout << tam;
    cout << "\n\n\n";
    cout << img;

    Imagen(img, cadRetorno, tam);
  
    tam = strlen(cadRetorno);
    cout << "\n\n\n";
    cout << tam;
    cout << "\n\n\n";
    cout << "Hola mundo\n\n\n";
    cout << cadRetorno;
  

   // leerArchivo();
}
/*
void leerArchivo() {
    
    ifstream archivo("imagen6.raw");
    string linea{};

    if (getline(archivo, linea))
    {
        char* resultado = new char[linea.size() + 1];
        copy(linea.begin(), linea.end(), resultado);
        resultado[linea.size()] = 0;
        cout << resultado << endl;
    }
  
}
 */

/*
void leerArchivo() {
    string nombre="imagen6.raw";
  // string nombre = "texto.txt";
    string linea;
    string temp="";
    char* cadena;
    ifstream fichero(nombre.c_str(), std::ios::binary);
    if (fichero.fail()) {
        cout << "No existe el fichero!" << endl;
        exit(1);
    }
    fichero.seekg(ios_base::end);
    temp.reserve(fichero.tellg());
    fichero.seekg(ios_base::beg);
    while (!fichero.eof()) {
        getline(fichero, linea);
        temp.append(linea+"\n");
    }
    cadena = &temp[0];

    //cout << temp << endl;
    cout << cadena << endl;

    fichero.close();
}

*/