
#include <iostream>
#include <fstream>
#include <string>
#include <cstdlib>
#include <stdio.h>
#include <stdlib.h>

extern "C" void Imagen(char* cad,char* cadRetorno,int tam);
using namespace std;


int main()
{
   //char img[]="       ÅÖàÅÖàÇÕàÇÕàÇÕàÇÕàÇÕàÇÕàÊÖâÊÖâË×ãË×ãË×ãÌØäÎØäÎØäÌÚåÌÚåÌÚåÍÛæÍÛæÍÛæÎÜçÎÜçÎÜçÎÜçÍÛæÌÚåÊØãÉ×âÈÖáÈÖáÈÕÞÈÕÞÉÖßÉÖßÉÖßÊ×àÊ×àÊ×àÊ×àÊ×àËØáËØáËØáÌÙâÌÙâÌÙâÌÙâÌÙâÌÙâÌÙâÌÙâÌÙâÌÙâÌÙâÌÙâÌÙâÍÚãÍÚãÍÚãÎÛäÎÛäÎÛäÔÞèÕßéÖàê×áëØâìÙãíÚäîÛåïÛåïÚäîÚäîÛåïÜæðÞèòàêôáëõâïõãðöåòøæóùèõûèõûèõûèõûëøþëøþìùÿìùÿìùÿëøþéöüèõûî÷üî÷üî÷üî÷üî÷üî÷üî÷üî÷üïøýî÷üíöûìõúìõúíöûî÷üïøýíøüíøüíøüíøüíøüíøüíøüíøüîùýîùýïúþïúþðûÿðûÿðûÿðûÿõýÿõýÿõýÿõýÿõýÿõýÿõýÿõýÿõÿÿôþÿôþÿôþÿóýþóýþòþþòþþòÿÿñÿÿñÿÿóþÿòýÿòýÿòýÿñüþñüþóýþóýþóýþôþÿôþÿôþÿõÿÿöÿþöÿþöÿþöÿþöÿþöÿþöÿþöÿþöÿþöÿþöÿþöÿþöÿþöÿþöÿþöÿþùÿÿùÿÿùÿÿùÿÿùÿÿùÿÿùÿÿùÿÿùÿÿùÿÿùÿÿùÿÿùÿÿùÿÿùÿÿùÿÿöÿþöÿþöÿþöÿþöÿþöÿþöÿþöÿþöÿþöÿþõþýõþýõþýôýüôýüôýüïþûïþûñýýñýýñýýòüýòüýòüýõýÿõýÿ÷üÿ÷üÿ÷üÿøûÿøûÿøûÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿôüÿõýÿõýÿõýÿõýÿõýÿõýÿõýÿõýÿ÷üÿ÷üÿ÷üÿ÷üÿ÷üÿ÷üÿ÷üÿ÷üÿõúþõúþõúþõúþõúþõúþõúþõúþóúÿóúÿóúÿòùÿòùÿòùÿñøþñøþð÷ýð÷ýð÷ýð÷ýð÷ýð÷ýð÷ýð÷ýðúüðúüðúüðúüñûýñûýñûýòüþòüþòüþòüþòüþòüþòüþòüþòüþòúýòúýòúýòúýòúýòúýòúýòúýóûþóûþóûþóûþóûþóûþóûþóûþ÷üÿ÷üÿöûÿôüÿôüÿóûþóûþóûþòúýñûýñûýñûýñûýñûýñûýñûýòúýòúýòúýòúýòúýòúýòúýòúýòúýòúýóûþóûþóûþôüÿôüÿôüÿôþÿôþÿôþÿôþÿõýÿõýÿõýÿõýÿõýÿ÷üÿøþþøþþùÿÿùÿÿùÿÿùÿÿûÿÿûÿÿûÿÿûÿÿýþÿýþÿýþÿýþÿþÿÿþÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿÿþÿ";
    char img[]="       ÅÖàÅÖàÇÕàÇÕàÇÕàÇÕàÇÕàÇÕàÊÖâ";
    char cadRetorno[] = "";
    int tam = strlen(img);
    cout << tam;
    cout << "\n";
    cout << img;
    Imagen(img, cadRetorno, tam);
    tam = strlen(cadRetorno);
    cout << "\n";
    cout << tam;
    cout << "\n";
    cout << cadRetorno;
    return 0;

}